HELYXcore-4.4.0/applications/test/volField/cavity/0/p
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    // Set empty. Explicit patch name should win.
    empty
    {
        type            MATCHEMPTYGROUP;
    }

    frontAndBack
    {
        type            empty;
    }

    ".*Back"
    {
        type            MATCHWILDCARD;
    }

    // Set walls. Last patchGroup should win.
    allBoundaryGroup
    {
        type            MATCHALLGROUP;
    }

    wallsGroup
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
